---
kind: property
id: P:Autodesk.Revit.DB.Analysis.HVACLoadType.PowerLoadDensity
source: html/f9c5e47e-a2ec-9581-39d4-7d92c4e60587.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadType.PowerLoadDensity Property

The power load density.

## Syntax (C#)
```csharp
public double PowerLoadDensity { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The value should be between [0.0,500000.0].